uhnp/src/Catalogs/Задачи/Задачи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Задачи</name>
  <attributes>
    <name>СвязанныйОбъект</name>
    <type>
      <types>DefinedType.ОбъектыДляСогласования</types>
    </type>
  </attributes>
</mdclass:Catalog>

uhnp/src/InformationRegisters/ОтложеннаяОбработкаЭтаповПроцессов/ОтложеннаяОбработкаЭтаповПроцессов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОтложеннаяОбработкаЭтаповПроцессов</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>ВремяСобытия</name>
    <comment>Количество часов до возникновения события</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КлючевойОбъект</name>
    <type>
      <types>DefinedType.ОбъектыДляСогласования</types>
    </type>
  </resources>
  <attributes>
    <name>ВремяНачалаЗадания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяЗавершенияЗадания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстКомментария</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ВидДействия</name>
    <type>
      <types>EnumRef.СобытияОтложеннойОбработкиПроцессов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДокументПроцесса</name>
    <type>
      <types>DocumentRef.ЭкземплярПроцесса</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЭтапПроцесса</name>
    <type>
      <types>CatalogRef.ЭтапыУниверсальныхПроцессов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипКлючевогоОбъекта</name>
    <type>
      <types>CatalogRef.ДокументыБД</types>
      <types>CatalogRef.СправочникиБД</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Выполнено</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Задача</name>
    <type>
      <types>CatalogRef.Задачи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/Catalogs/Задачи/ManagerModule.bsl
// Возвращает таблицу параметров задач в приске СписокЗадачВход
Функция ПолучитьТаблицуПараметровЗадач(СписокЗадачВход) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ОтложеннаяОбработкаЭтаповПроцессов.ВидДействия,
		|	ОтложеннаяОбработкаЭтаповПроцессов.Задача,
		|	ОтложеннаяОбработкаЭтаповПроцессов.ВремяНачалаЗадания,
		|	ОтложеннаяОбработкаЭтаповПроцессов.ВремяЗавершенияЗадания,
		|	ОтложеннаяОбработкаЭтаповПроцессов.Выполнено,
		|	ОтложеннаяОбработкаЭтаповПроцессов.Ответственный,
		|	ОтложеннаяОбработкаЭтаповПроцессов.ЭтапПроцесса,
		|	ОтложеннаяОбработкаЭтаповПроцессов.Задача.СвязанныйОбъект КАК СвязанныйОбъект
		|ИЗ
		|	РегистрСведений.ОтложеннаяОбработкаЭтаповПроцессов КАК ОтложеннаяОбработкаЭтаповПроцессов
		|ГДЕ
		|	ОтложеннаяОбработкаЭтаповПроцессов.Задача В(&Задача)";
	Запрос.УстановитьПараметр("Задача", СписокЗадачВход);
	РезультатЗапроса = Запрос.Выполнить();
	РезультатФункции = РезультатЗапроса.Выгрузить();
	Возврат РезультатФункции;
КонецФункции

// Определяет выполнена ли задача в строке таблицы параметров задачи 
// СтрокаТаблицыПараметровВход;
Функция ЗадачаВСтрокеВыполнена(СтрокаТаблицыПараметровВход)
	РезультатФункции = (СтрокаТаблицыПараметровВход.Выполнено) ИЛИ (ЗначениеЗаполнено(СтрокаТаблицыПараметровВход.ВремяЗавершенияЗадания));
	Возврат РезультатФункции;
КонецФункции		// ЗадачаВСтрокеВыполнена

// Определяет, все ли переданные задачи в СписокЗадачВход не выполнены.
Функция ЗадачиНеВыполнены(СписокЗадачВход) Экспорт
	РезультатФункции = Истина;
	ТаблицаПараметров = ПолучитьТаблицуПараметровЗадач(СписокЗадачВход);
	Если ТаблицаПараметров.Количество() = 0 Тогда
		РезультатФункции = Ложь;
	Иначе	
		Для Каждого ТекТаблицаПараметров Из ТаблицаПараметров Цикл
			ЗадачаВыполнена = ЗадачаВСтрокеВыполнена(ТекТаблицаПараметров);
			Если ЗадачаВыполнена Тогда
				РезультатФункции = Ложь;
			Иначе
				// Условия выполнены. Продолжаем поиск.
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	Возврат РезультатФункции;
КонецФункции		// ЗадачиНеВыполнены

// Определяет, разрешено ли пользователю ПользовательВход завершать
// задачи в списке СписокЗадачВход.
Функция РазрешеноЗавершатьЗадачи(СписокЗадачВход, ПользовательВход) Экспорт
	РезультатФункции = Истина;
	ТаблицаПараметров = ПолучитьТаблицуПараметровЗадач(СписокЗадачВход);
	ЕстьТекущийПользователь = Ложь;
	Для Каждого ТекТаблицаПараметров Из ТаблицаПараметров Цикл
		ЗадачаВыполнена = ЗадачаВСтрокеВыполнена(ТекТаблицаПараметров);
		Если ЗадачаВыполнена Тогда
			РезультатФункции = Ложь;
		Иначе
			// Условия выполнены. Продолжаем поиск.
		КонецЕсли;
		Если ТекТаблицаПараметров.Ответственный = ПользовательВход Тогда
			// Пользователь найден.
			ЕстьТекущийПользователь = Истина;
		Иначе
			// Пользователь не найден, проверим заместителей.
			СписокЗамещаемых = Новый СписокЗначений;
			МодульУправленияПроцессамиУХ.ПолучитьЗамещаемых(ПользовательВход, СписокЗамещаемых);
			ОтветственныеЗамещаемыеТекущегоПользователя = (СписокЗамещаемых.НайтиПоЗначению(ТекТаблицаПараметров.Ответственный) <> Неопределено);
			Если ОтветственныеЗамещаемыеТекущегоПользователя Тогда
				ЕстьТекущийПользователь = Истина;
			Иначе
				// Данный пользователь не совпадает. Выполняем далее.
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	Если НЕ ЕстьТекущийПользователь Тогда
		РезультатФункции = Ложь;
	Иначе
		// Текущий пользователь есть в списке ответственных. Не изменяем результат.
	КонецЕсли;
	Возврат РезультатФункции;
КонецФункции		// РазрешеноЗавершатьЗадачи

// Возвращает массив, содержащий все связанные объекты по списку задач СписокЗадачВход.
Функция ПолучитьМассивСвязанныхОбъектовЗадач(СписокЗадачВход) Экспорт
	РезультатФункции = Новый Массив;
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	Задачи.СвязанныйОбъект
	|ИЗ
	|	Справочник.Задачи КАК Задачи
	|ГДЕ
	|	Задачи.Ссылка В(&Задачи)
	|	И Задачи.ПометкаУдаления = ЛОЖЬ";
	Запрос.УстановитьПараметр("Задачи", СписокЗадачВход);
	РезультатЗапроса = Запрос.Выполнить();
	Выгрузка = РезультатЗапроса.Выгрузить();
	РезультатФункции = Выгрузка.ВыгрузитьКолонку("СвязанныйОбъект");
	Возврат РезультатФункции;
КонецФункции		// ПолучитьМассивСвязанныхОбъектовЗадач

// Возвращает массив задач текущего пользователя по объекту согласования СсылкаВход.
Функция ПолучитьЗадачиПользователяПоОбъекту(СсылкаВход) Экспорт
	РезультатФункции = Новый Массив;
	ТекПользователь = ОбщегоНазначенияУХ.ПолучитьЗначениеПеременной("глТекущийПользователь");
	СписокЗамещаемых = Новый СписокЗначений;
	МодульУправленияПроцессамиУХ.ПолучитьЗамещаемых(ТекПользователь, СписокЗамещаемых);
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ОтложеннаяОбработкаЭтаповПроцессовСрезПоследних.Задача
	|ИЗ
	|	РегистрСведений.ОтложеннаяОбработкаЭтаповПроцессов.СрезПоследних(
	|			,
	|			Выполнено = ЛОЖЬ
	|				И Ответственный В (&СписокЗамещаемых)
	|				И ДокументПроцесса.КлючевойОбъектПроцесса В (&КлючевойОбъект)) КАК ОтложеннаяОбработкаЭтаповПроцессовСрезПоследних
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ОтложеннаяОбработкаЭтаповПроцессовСрезПоследних.Задача
	|ИЗ
	|	РегистрСведений.ОтложеннаяОбработкаЭтаповПроцессов.СрезПоследних(
	|			,
	|			Выполнено = ЛОЖЬ
	|				И Ответственный = &ТекущийПользователь
	|				И ДокументПроцесса.КлючевойОбъектПроцесса В (&КлючевойОбъект)) КАК ОтложеннаяОбработкаЭтаповПроцессовСрезПоследних";
	Запрос.УстановитьПараметр("КлючевойОбъект", СсылкаВход);
	Запрос.УстановитьПараметр("СписокЗамещаемых", СписокЗамещаемых);
	Запрос.УстановитьПараметр("ТекущийПользователь", ТекПользователь);
	РезультатЗапроса = Запрос.Выполнить();
	Выгрузка = РезультатЗапроса.Выгрузить();
	РезультатФункции = Выгрузка.ВыгрузитьКолонку("Задача");
	Возврат РезультатФункции;
КонецФункции		// ПолучитьЗадачиПользователяПоОбъекту

// Возвращает массив задач, привязанных к объекту СсылкаВход.
Функция ПолучитьВсеЗадачиПоОбъекту(СсылкаВход) Экспорт
	РезультатФункции = Новый Массив;
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Задачи.Ссылка КАК Ссылка,
		|	Задачи.СвязанныйОбъект КАК СвязанныйОбъект
		|ИЗ
		|	Справочник.Задачи КАК Задачи
		|ГДЕ
		|	НЕ Задачи.ПометкаУдаления
		|	И Задачи.СвязанныйОбъект = &СвязанныйОбъект";
	Запрос.УстановитьПараметр("СвязанныйОбъект", СсылкаВход);
	РезультатЗапроса = Запрос.Выполнить();
	Выгрузка = РезультатЗапроса.Выгрузить();
	РезультатФункции = Выгрузка.ВыгрузитьКолонку("Ссылка");
	Возврат РезультатФункции;
КонецФункции		// ПолучитьВсеЗадачиПоОбъекту
